{
  "backend/main.mo": "Motoko canister defining CMS data types, admin authentication with token management, and CRUD state maps for sections, products, gallery, messages, and settings.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in routing, auth, queries, and UI behavior.",
  "frontend/index.css": "Tailwind CSS setup with custom CSS variables for light and dark themes and base styling rules.",
  "frontend/index.html": "HTML entry point defining root element and loading the main React script.",
  "frontend/src/admin/AdminLayout.tsx": "Admin layout with sidebar navigation and logout handling, wrapping admin pages inside a container with Outlet.",
  "frontend/src/admin/AdminLogin.tsx": "Renders the admin login form, handles credential submission, and displays login or session errors.",
  "frontend/src/admin/AdminRoutes.tsx": "Controls admin routing based on session token and actor state, validating tokens and handling backend errors.",
  "frontend/src/admin/components/AdminDeleteConfirmDialog.tsx": "Reusable confirmation dialog for delete actions with optional loading state.",
  "frontend/src/admin/components/AdminFormErrorAlert.tsx": "Displays a styled error alert for form-level errors.",
  "frontend/src/admin/components/InitializeContentCard.tsx": "Card that lets admins initialize sample site content with confirmation and loading states.",
  "frontend/src/admin/hooks/useAdminAccounts.ts": "React Query hooks for listing, adding, and deleting admin accounts with error normalization.",
  "frontend/src/admin/hooks/useAdminAuth.ts": "Provides admin login and logout mutations, handling token extraction and readable auth errors.",
  "frontend/src/admin/hooks/useAdminContentMutations.ts": "Defines mutations for creating, updating, and deleting sections and products, invalidating relevant queries.",
  "frontend/src/admin/hooks/useAdminPassword.ts": "Provides a React Query mutation for changing the admin password, including token validation and error normalization.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages admin session token and session error values using sessionStorage with helper setters and clearers.",
  "frontend/src/admin/pages/AdminAccountsPage.tsx": "UI for listing, creating, and deleting admin accounts with validation, mutations, and status handling.",
  "frontend/src/admin/pages/AdminDashboard.tsx": "Displays admin dashboard statistics sourced from various queries and shows quick navigation guidance.",
  "frontend/src/admin/pages/AdminNotFound.tsx": "Renders a styled 404 page for missing admin routes with a link back to the dashboard.",
  "frontend/src/admin/pages/ChangePasswordPage.tsx": "Form for changing the admin password with client-side validation and success/error feedback.",
  "frontend/src/admin/pages/ContactInfoEditor.tsx": "Editor for updating business contact info with validation, mutations, and loading/error states.",
  "frontend/src/admin/pages/GalleryEditor.tsx": "Allows adding, editing, and deleting gallery items with form validation, mutations, and confirmation dialogs.",
  "frontend/src/admin/pages/MessagesInbox.tsx": "Displays and manages contact messages with loading, error, delete, and empty states.",
  "frontend/src/admin/pages/ProductsEditor.tsx": "CRUD interface for products including form validation, add/edit modes, and delete confirmation.",
  "frontend/src/admin/pages/SectionsEditor.tsx": "Provides UI for creating, editing, and deleting content sections with validation and state handling.",
  "frontend/src/admin/pages/SiteSettingsEditor.tsx": "Form for editing and saving basic site settings like name and logo URL.",
  "frontend/src/admin/ProfileSetupModal.tsx": "Modal for collecting and saving the user’s display name during initial profile setup.",
  "frontend/src/admin/utils/adminAuthErrorMessages.ts": "Maps replica rejection details to user-facing admin auth error messages and token-preservation logic.",
  "frontend/src/admin/utils/option.ts": "Utility for extracting string tokens from Motoko option-like values.",
  "frontend/src/admin/utils/replicaRejection.ts": "Parses errors to extract replica rejection details, detecting canister stoppage, connectivity issues, and unauthorized states.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, query client, layouts, and all public and admin routes.",
  "frontend/src/components/BackendUnavailableState.tsx": "Shows a server connectivity error message with retry and diagnostics links in compact or full layouts.",
  "frontend/src/components/BrandLogo.tsx": "Displays the site logo using settings data with a fallback image and error handler.",
  "frontend/src/components/BuildVersionLabel.tsx": "Renders the app's build version and a preview badge if in preview channel.",
  "frontend/src/components/ContactForm.tsx": "Implements a contact form with validation and message submission via API.",
  "frontend/src/components/HeaderNav.tsx": "Provides responsive site navigation with links, branding, mobile drawer, and logout handling.",
  "frontend/src/components/PublicAppErrorBoundary.tsx": "Error boundary that catches UI errors and shows a recovery UI with reload and home options.",
  "frontend/src/components/QueryState.tsx": "Contains reusable loading, error, empty, and skeleton UI components for data-fetching states.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with contact info, quick links, version label, and connectivity fallback handling.",
  "frontend/src/components/StartupHealthGate.tsx": "Gate component that waits for actor initialization and backend health before rendering children, showing loading or error states as needed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing related queries when the actor changes.",
  "frontend/src/hooks/useBackendHealth.ts": "Provides a health‑check query for the backend with timeout handling and exposes a simplified reachability status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading identities, handling login/logout, and exposing status flags.",
  "frontend/src/hooks/useLogout.ts": "Clears Internet Identity session and wipes all react‑query caches on logout.",
  "frontend/src/hooks/useQueries.ts": "Collection of data‑fetching and mutation hooks that call backend actor methods with timeouts and react‑query integration.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables defining light/dark theme colors and utilities.",
  "frontend/src/layout/PublicLayout.tsx": "Public layout wrapper with header, footer, and routed content slot.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, react‑query client, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Fetches and displays 'About'‑related sections with loading, error, and empty‑state handling.",
  "frontend/src/pages/ContactPage.tsx": "Fetches and displays contact info with loading and connectivity error handling, and renders a contact form and business details.",
  "frontend/src/pages/DiagnosticsPage.tsx": "Shows backend connectivity and actor initialization status, retrieves stored errors, and provides tools to retry and reset diagnostics.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays gallery items with modal previews, handles loading and connectivity errors, and falls back on missing images.",
  "frontend/src/pages/HomePage.tsx": "Loads site settings and content sections to render a hero and feature sections, with error handling and fallback images.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays products in a card grid with loading, error handling, and image fallbacks.",
  "frontend/src/pages/PublicNotFound.tsx": "Renders a simple 404 page with navigation options to return home or go back.",
  "frontend/src/utils/buildInfo.ts": "Generates a build version string from environment variables with fallbacks.",
  "frontend/src/utils/connectivityDiagnostics.ts": "Provides functions to store, retrieve, and clear the last connectivity error using sessionStorage.",
  "frontend/src/utils/queryTimeout.ts": "Provides a timeout wrapper for async queries and utilities to normalize and detect connectivity-related backend errors.",
  "frontend/src/utils/releaseChannel.ts": "Determines whether the app is in production or preview mode using env vars and URL patterns.",
  "frontend/src/utils/routerBasePath.ts": "Computes the router base path from build-time config or preview URL segments.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, radius, shadows, and animations with plugin support.",
  "project_state.json": "Stores project metadata, feature requirements, known issues, and fix requests for the CMS Admin Panel."
}