{
  "backend/main.mo": "Motoko backend defining CMS types, admin authentication with token management, and CRUD state for sections, products, gallery, messages, and settings.",
  "feature_evidence.json": "Feature evidence report listing impacted frontend files, components, and test IDs for two deployment and reliability features.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing authentication, routing, connectivity handling, and admin features.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark CSS variables and global UI styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/admin/AdminLayout.tsx": "Admin layout with sidebar navigation and logout handling that renders nested admin pages.",
  "frontend/src/admin/AdminLogin.tsx": "Admin login form using username/password with error handling, loading states, and version label.",
  "frontend/src/admin/AdminRoutes.tsx": "Handles admin routing, session validation, actor initialization, and displays login, errors, or admin layout based on token and backend status.",
  "frontend/src/admin/components/AdminDeleteConfirmDialog.tsx": "Reusable confirmation dialog for delete actions with optional loading state.",
  "frontend/src/admin/components/AdminFormErrorAlert.tsx": "Displays a styled error alert for admin form validation or mutation errors.",
  "frontend/src/admin/components/ImageStringUploadField.tsx": "Image upload/input component supporting file-to-base64 conversion, error handling, and preview.",
  "frontend/src/admin/components/InitializeContentCard.tsx": "Card that triggers sample content initialization with a confirmation dialog and progress state.",
  "frontend/src/admin/hooks/useAdminAccounts.ts": "React Query hooks for listing, adding, and deleting admin accounts with error normalization.",
  "frontend/src/admin/hooks/useAdminAuth.ts": "Provides login/logout mutations for admin authentication with token extraction and friendly error messages.",
  "frontend/src/admin/hooks/useAdminContentMutations.ts": "React Query mutations for creating, updating, and deleting sections and products using actor calls with timeout handling.",
  "frontend/src/admin/hooks/useAdminPassword.ts": "Provides a mutation hook for changing the admin password with validation and normalized error handling.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages admin session state by storing, retrieving, and clearing the admin token and session errors from sessionStorage.",
  "frontend/src/admin/pages/AdminAccountsPage.tsx": "UI for listing, creating, and deleting admin accounts with client-side validation and backend mutations.",
  "frontend/src/admin/pages/AdminDashboard.tsx": "Displays admin dashboard stats for sections, products, gallery items, and messages using multiple queries.",
  "frontend/src/admin/pages/AdminNotFound.tsx": "Renders a not-found page for invalid admin routes with navigation back to the dashboard.",
  "frontend/src/admin/pages/ChangePasswordPage.tsx": "Form page allowing an admin to change their password with validation and mutation handling.",
  "frontend/src/admin/pages/ContactInfoEditor.tsx": "Editor page for viewing and updating contact information with validation and admin-authenticated mutations.",
  "frontend/src/admin/pages/GalleryEditor.tsx": "Interface for adding, editing, and deleting gallery items, including form validation and admin-protected mutations.",
  "frontend/src/admin/pages/MessagesInbox.tsx": "Admin inbox page listing contact messages, supporting deletion with confirmation and handling loading/error states.",
  "frontend/src/admin/pages/ProductsEditor.tsx": "Admin UI for adding, editing, and deleting products with form validation, image upload, and mutation handling.",
  "frontend/src/admin/pages/SectionsEditor.tsx": "Admin interface for creating, editing, and deleting page sections with form validation and mutation handling.",
  "frontend/src/admin/pages/SiteSettingsEditor.tsx": "Form-based editor allowing admins to view and update site settings such as name and logo.",
  "frontend/src/admin/ProfileSetupModal.tsx": "Modal that collects and saves a user's display name during initial profile setup.",
  "frontend/src/admin/utils/adminAuthErrorMessages.ts": "Maps replica rejection details to user-friendly admin auth error messages and determines when to preserve tokens.",
  "frontend/src/admin/utils/fileToImageString.ts": "Utility converting image files to data URLs with type and size validation.",
  "frontend/src/admin/utils/option.ts": "Helper extracting string tokens from Motoko optional return structures.",
  "frontend/src/admin/utils/replicaRejection.ts": "Parses errors to extract replica rejection details including codes, messages, and flags for canister or connectivity issues.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router and public/admin routes with shared layouts and health gate.",
  "frontend/src/components/BackendUnavailableState.tsx": "Displays a server connectivity error message with retry and diagnostics options, supporting compact and full layouts.",
  "frontend/src/components/BrandLogo.tsx": "Renders the site logo using settings data with a fallback image on error.",
  "frontend/src/components/BuildVersionLabel.tsx": "Shows the build version and optionally a preview badge based on the release channel.",
  "frontend/src/components/ContactForm.tsx": "Implements a contact form with validation and message submission using a query hook.",
  "frontend/src/components/HeaderNav.tsx": "Provides responsive navigation with links, logo, mobile menu, and optional authenticated logout.",
  "frontend/src/components/PublicAppErrorBoundary.tsx": "Catches application errors and displays a recovery UI with reload and home navigation options.",
  "frontend/src/components/QueryState.tsx": "Exports reusable loading, error, empty, and skeleton UI components for query-driven views.",
  "frontend/src/components/SiteFooter.tsx": "Shows the site footer with links, contact info, version label, and fallback error state on connectivity issues.",
  "frontend/src/components/StartupHealthGate.tsx": "Displays loading, retry, or error states while initializing the backend actor and health checks, rendering children only when ready.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendHealth.ts": "Provides backend health checks with timeout, retry logic, and derived status values for connection handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, loading identities, handling login/logout, and providing identity state.",
  "frontend/src/hooks/useLogout.ts": "Clears the Internet Identity session and wipes all cached queries on logout.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating backend data such as sections, products, gallery, settings, messages, and profiles.",
  "frontend/src/index.css": "Configures Tailwind and custom CSS variables for themes, colors, and layout utilities.",
  "frontend/src/layout/PublicLayout.tsx": "Provides a public-facing page layout with header, footer, and routed content.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Loads and displays 'About' sections from the backend with loading, error, and empty‑state handling.",
  "frontend/src/pages/ContactPage.tsx": "Fetches and displays contact info with fallback states and renders a contact form.",
  "frontend/src/pages/DiagnosticsPage.tsx": "Shows backend and actor connection diagnostics with stored error retrieval and retry handling.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays a gallery grid with image dialogs and connectivity/error fallbacks.",
  "frontend/src/pages/HomePage.tsx": "Fetches site settings and sections to render the homepage hero and feature content with error handling.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays product cards with loading, empty, and connectivity error states.",
  "frontend/src/pages/PublicNotFound.tsx": "Simple 404 page offering navigation back to home or previous page.",
  "frontend/src/utils/buildInfo.ts": "Generates a build version string from environment variables with fallback logic.",
  "frontend/src/utils/connectivityDiagnostics.ts": "Stores, retrieves, and clears the last connectivity error in sessionStorage.",
  "frontend/src/utils/queryTimeout.ts": "Provides a timeout wrapper for async queries and utilities to detect and normalize connectivity-related errors.",
  "frontend/src/utils/releaseChannel.ts": "Determines whether the app is running in production or preview mode using environment variables and URL patterns.",
  "frontend/src/utils/routerBasePath.ts": "Computes the router base path from environment variables or preview-specific URL segments.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including session-backed persistence and hash cleanup.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, shadows, and animations with custom design tokens.",
  "project_state.json": "Project metadata describing current state, issues, and feature requests including a rollback and connectivity improvements."
}