{
  "backend/main.mo": "Motoko canister implementing authorization, admin token auth, and CRUD state for profiles, CMS sections, products, gallery, messages, contact info, and site settings.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for various frontend files describing behavior and responsibilities.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables for light and dark modes with base styling.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/admin/AdminLayout.tsx": "Admin layout with sidebar navigation, logout handling, and an Outlet for nested admin pages.",
  "frontend/src/admin/AdminLogin.tsx": "Renders an admin login form with username/password inputs, error handling, and session-based login logic.",
  "frontend/src/admin/AdminRoutes.tsx": "Controls admin routing by checking token validity, initializing the actor, handling backend errors, and showing login or layout.",
  "frontend/src/admin/components/InitializeContentCard.tsx": "Displays a card that lets admins initialize sample site content through a confirmation dialog.",
  "frontend/src/admin/hooks/useAdminAuth.ts": "Implements login and logout mutations for admin authentication, handling token extraction and error translation.",
  "frontend/src/admin/hooks/useAdminSession.ts": "Manages storing, retrieving, and clearing the admin token and session errors in sessionStorage.",
  "frontend/src/admin/pages/AdminDashboard.tsx": "Shows admin dashboard stats for sections, products, gallery items, and messages, with loading and quick actions.",
  "frontend/src/admin/pages/AdminNotFound.tsx": "Displays a 404-style page for missing admin routes with a link back to the dashboard.",
  "frontend/src/admin/pages/ContactInfoEditor.tsx": "Placeholder page for editing site contact information.",
  "frontend/src/admin/pages/GalleryEditor.tsx": "Placeholder page for managing gallery images.",
  "frontend/src/admin/pages/MessagesInbox.tsx": "Placeholder page for viewing and managing user contact messages.",
  "frontend/src/admin/pages/ProductsEditor.tsx": "Static admin page showing a placeholder for future product management.",
  "frontend/src/admin/pages/SectionsEditor.tsx": "Static admin page showing a placeholder for editing website content sections.",
  "frontend/src/admin/pages/SiteSettingsEditor.tsx": "Form-driven admin page to load and save site name and logo settings with validation and mutation handling.",
  "frontend/src/admin/ProfileSetupModal.tsx": "Provides a modal for entering and saving a user's name during initial profile setup.",
  "frontend/src/admin/utils/adminAuthErrorMessages.ts": "Defines admin auth error messages and utilities to map replica rejection details to user-friendly text and decide token preservation.",
  "frontend/src/admin/utils/option.ts": "Utility to extract a string token from various Motoko optional return formats.",
  "frontend/src/admin/utils/replicaRejection.ts": "Parses errors to extract replica rejection details, detect canister-stopped and connectivity failures.",
  "frontend/src/App.tsx": "Main React app routes configuration with public and admin areas, error boundaries, layout components, and query client setup.",
  "frontend/src/components/BackendUnavailableState.tsx": "UI component displaying retry and diagnostics options when backend connectivity fails.",
  "frontend/src/components/BrandLogo.tsx": "Displays the site logo using settings with a fallback image and error handling.",
  "frontend/src/components/BuildVersionLabel.tsx": "Renders the current build version and optional preview badge.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation and mutation to send messages, showing success or error toasts.",
  "frontend/src/components/HeaderNav.tsx": "Responsive site header with navigation links, mobile drawer menu, branding, and optional logout.",
  "frontend/src/components/PublicAppErrorBoundary.tsx": "React error boundary that catches UI errors and shows a fallback card with reload and home navigation options.",
  "frontend/src/components/QueryState.tsx": "Provides reusable loading, error, empty, and skeleton UI components for query-driven views.",
  "frontend/src/components/SiteFooter.tsx": "Footer component that loads contact info and site settings, handles connectivity errors, and displays links and metadata.",
  "frontend/src/components/StartupHealthGate.tsx": "Gate component that waits for actor initialization and backend health checks, showing loading or error UI before rendering children.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBackendHealth.ts": "Runs a timed backend health check using the actor and exposes a normalized status and message.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and managing login and logout states.",
  "frontend/src/hooks/useLogout.ts": "Clears the Internet Identity session and wipes all cached query data.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as sections, products, gallery items, contact info, settings, messages, and user profiles.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and color variables for light and dark themes with custom palette definitions.",
  "frontend/src/layout/PublicLayout.tsx": "Provides the public site layout with header, footer, and routed main content area.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Loads and displays filtered 'About' sections with loading, connectivity error, and empty state handling.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and a contact form, including loading and backend error handling.",
  "frontend/src/pages/DiagnosticsPage.tsx": "Shows backend connectivity diagnostics, actor initialization status, and tools to retry or reset connection state.",
  "frontend/src/pages/GalleryPage.tsx": "Fetches and displays gallery items with skeleton loading, error fallback, a grid of images, and an image preview dialog.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage, loading site settings and sections with error handling, and displays a hero section with images and feature content.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays products with loading, empty, and connectivity error states, rendering product cards with images and pricing.",
  "frontend/src/pages/PublicNotFound.tsx": "Displays a styled 404 page with navigation options to go home or return to the previous page.",
  "frontend/src/utils/buildInfo.ts": "Generates a build version string using environment variables, git commit, or timestamp with fallbacks.",
  "frontend/src/utils/connectivityDiagnostics.ts": "Provides helpers to store, retrieve, and clear the last connectivity error in sessionStorage.",
  "frontend/src/utils/queryTimeout.ts": "Implements a timeout wrapper for async queries and utilities to normalize and detect connectivity-related errors.",
  "frontend/src/utils/releaseChannel.ts": "Determines whether the app is running in production or preview mode based on environment variables or URL.",
  "frontend/src/utils/routerBasePath.ts": "Computes the router base path from environment config or preview URL patterns.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting, persisting, and managing URL parameters across query strings, hash routing, and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, shadows, and plugin integrations.",
  "project_state.json": "Defines project state, goals, architectural notes, existing features, and known issues for building a website with an admin CMS. Includes deployment problems, admin login issues, routing errors, and frontend loading failures."
}