{
  "kind": "build_request",
  "title": "Rollback deployment to Version 19 and restore homepage backend connectivity",
  "projectName": "Caffine AI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rebuild and redeploy the application as Version 19 (rollback from the currently deployed Version 20) so the public homepage no longer shows the 'Backend Unreachable' screen.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "re build to version 19"
        ]
      },
      "acceptanceCriteria": [
        "The deployed site reports build version '19' via the existing build version UI (BuildVersionLabel/getBuildVersion).",
        "Loading the homepage no longer immediately renders the 'Backend Unreachable' error state under normal network conditions.",
        "Admin routes still load and function after the Version 19 deployment."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Harden the app’s post-deploy startup connectivity flow so that transient backend wake-up time does not strand users on the 'Backend Unreachable' screen on the homepage; add an automatic re-check/retry window before showing the final unreachable state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "homepage",
          "i did it. not working"
        ]
      },
      "acceptanceCriteria": [
        "On initial load, the app automatically retries backend health checks for a short window (e.g., multiple attempts) before showing the unreachable UI.",
        "The existing 'Try Again' and 'Reload Page' actions continue to work and trigger a new health check / reconnection attempt.",
        "If the backend becomes reachable during the retry window, the app proceeds to render the homepage without requiring a manual reload."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if a state upgrade is required.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding new product features unrelated to deployment rollback/connectivity.",
    "Changing authentication providers (Internet Identity only).",
    "Introducing external databases, servers, or real-time WebSockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}