{
  "kind": "build_request",
  "title": "Restore working production version and add rollback safety",
  "projectName": "Atik Auto Rice Mills",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "Restore the last known working deployed version as the primary production version so the site is usable again, and keep the currently-deployed (broken) version accessible separately for troubleshooting (do not replace or delete the previous working deployment).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "not working \n\nKeep previous version alive"
        ]
      },
      "acceptanceCriteria": [
        "Production traffic serves the last known working version again (no blank screen / broken navigation regressions compared to that version).",
        "The currently-deployed version remains accessible via a separate, clearly identified access path (e.g., a preview URL or versioned path), without impacting the restored production version.",
        "No data/content stored in the backend is lost due to the rollback (CMS content, messages, settings remain intact)."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Add a visible build/version identifier to the frontend UI (public pages and admin login screen) so testers can confirm which version they are viewing, using only English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep previous version alive"
        ]
      },
      "acceptanceCriteria": [
        "Public pages display a small, non-intrusive version label (e.g., in the footer) indicating the build/version string.",
        "Admin login screen displays the same build/version label.",
        "The version label is present in production builds and can be used to distinguish the restored version from the broken one."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Implement a safer release flow in the app so that if the backend is unreachable or the app hits a fatal runtime error during startup, users see a clear English error screen with a recovery action (Reload / Try Again) rather than a broken/blank experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "not working"
        ]
      },
      "acceptanceCriteria": [
        "If the backend cannot be reached at load time, the app renders a user-friendly English error state with a working recovery action (Reload and/or Try Again).",
        "If a runtime exception occurs during public route rendering, a user-friendly English error UI is shown instead of a blank/white screen.",
        "Recovery actions do not cause infinite loading loops; they deterministically retry initialization and either recover or re-display the error state."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Respect the existing single-actor Motoko backend architecture (no additional backend services).",
    "Do not edit files under frontend/src/components/ui, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (compose instead)."
  ],
  "nonGoals": [
    "Adding new product features unrelated to restoring functionality and rollback safety.",
    "Introducing external hosting, databases, or third-party deployment services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}