{
  "kind": "build_request",
  "title": "Implement working admin editors for Sections, Products, Gallery, Contact Info, and Messages",
  "projectName": "CMS Admin Panel",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the placeholder admin pages (Page Sections, Products, Gallery, Contact Info, Messages) so they no longer display 'coming soon' and instead provide fully working CRUD/admin functionality backed by existing canister methods.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Page Sections\nProducts\nGallery\nContact Info\nMessages\n\n\nthese option not working \nits says\nsection editor coming soon",
          "another try?"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin/sections no longer shows the placeholder text and provides a working UI to list, create, edit, and delete sections.",
        "Visiting /admin/products no longer shows the placeholder text and provides a working UI to list, create, edit, and delete products (name, description, price, imageUrl).",
        "Visiting /admin/gallery no longer shows the placeholder text and provides a working UI to list, create, edit, and delete gallery items (title, caption, imageUrl).",
        "Visiting /admin/contact no longer shows the placeholder text and provides a working UI to view and update contact info (address, phone, email).",
        "Visiting /admin/messages no longer shows the placeholder text and provides a working UI to list messages and delete a message.",
        "All admin editor actions require and use the current admin session token (from existing admin session handling)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add React Query mutation hooks for admin content management (sections/products/gallery/contact info/messages) and wire them into the corresponding admin editor pages, including query invalidation so lists refresh after changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "these option not working \nits says\nsection editor coming soon"
        ]
      },
      "acceptanceCriteria": [
        "There are mutation hooks available for: createSection, updateSection, deleteSection; addProduct, updateProduct, deleteProduct; addGalleryItem, updateGalleryItem, deleteGalleryItem; updateContactInfo; deleteMessage.",
        "After a successful create/update/delete, the relevant query cache is invalidated and the UI updates without needing a full page reload.",
        "If the admin token is missing/expired, the UI shows a user-facing error state consistent with existing admin error handling (no silent failures)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement basic, consistent admin editor UX for each page: list view with empty/loading/error states, an 'Add' action, edit capability, and a delete confirmation flow (where applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Page Sections\nProducts\nGallery\nContact Info\nMessages"
        ]
      },
      "acceptanceCriteria": [
        "Each editor page shows a loading state while fetching data and a clear empty state when there are no items.",
        "Each editor page provides an Add flow (except Contact Info which is update-only).",
        "Edit flows allow updating existing entries and saving changes.",
        "Delete flows require user confirmation before the delete mutation runs.",
        "Form validation prevents submitting empty required fields (e.g., section title/content; product name/description/imageUrl; gallery title/imageUrl; contact email/phone/address)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only and must be composed, not modified).",
    "Do not edit the immutable hook files listed in SYSTEM_CONTEXT (compose around them instead).",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); only add backend changes if required to support the editors (expected to be minimal because CRUD methods already exist)."
  ],
  "nonGoals": [
    "Implementing image uploads or file storage; imageUrl fields will remain URL/path text inputs.",
    "Changing the existing admin authentication mechanism (username/password token flow).",
    "Adding real-time updates (no websockets/live push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}