{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollback-visible Version 19 labeling and resilient startup backend connectivity",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the UI reports build version '19' and avoid immediate public homepage 'Backend Unreachable' after the rollback deployment.",
      "acceptanceCriteria": [
        "The deployed site reports build version '19' via the existing build version UI (BuildVersionLabel/getBuildVersion).",
        "Loading the homepage no longer immediately renders the 'Backend Unreachable' error state under normal network conditions.",
        "Admin routes still load and function after the Version 19 deployment."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/buildInfo.ts",
          "operation": "modify",
          "description": "Update getBuildVersion() fallback behavior to reliably report build version '19' when a build-time version is not provided, preserving existing precedence when VITE_BUILD_VERSION is set."
        },
        {
          "path": "frontend/src/components/StartupHealthGate.tsx",
          "operation": "modify",
          "description": "Adjust startup health gating so the public app is not immediately stranded on the unreachable screen during transient backend wake-up (align behavior with the retry window introduced in REQ-2) while keeping admin navigation functional."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an automatic post-deploy startup retry window for backend reachability before showing the final 'Backend Unreachable' state on the homepage.",
      "acceptanceCriteria": [
        "On initial load, the app automatically retries backend health checks for a short window (e.g., multiple attempts) before showing the unreachable UI.",
        "The existing 'Try Again' and 'Reload Page' actions continue to work and trigger a new health check / reconnection attempt.",
        "If the backend becomes reachable during the retry window, the app proceeds to render the homepage without requiring a manual reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendHealth.ts",
          "operation": "modify",
          "description": "Enable controlled automatic retry behavior for the backend health check (multiple attempts within a short window) and expose enough state (e.g., retrying vs final failure) for the startup gate to delay rendering the final unreachable UI."
        },
        {
          "path": "frontend/src/components/StartupHealthGate.tsx",
          "operation": "modify",
          "description": "Implement a startup retry window UX: continue showing a 'checking/connecting' state while health checks are retrying, and only render the final unreachable screen after retries are exhausted; ensure 'Try Again' triggers a fresh retry cycle and 'Reload Page' still forces a full reload."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Align homepage connectivity fallback with the improved startup gating so transient startup errors do not immediately force the full-page BackendUnavailableState, while preserving existing manual retry behavior for content queries."
        }
      ]
    }
  ]
}