{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore usability with rollback safety UX, version labeling, and resilient startup",
  "requirements": [
    {
      "id": "REQ-51",
      "summary": "Enable safe side-by-side access paths for restored production and broken build via configurable base path and clearly identified preview mode UI hints.",
      "acceptanceCriteria": [
        "Production traffic serves the last known working version again (no blank screen / broken navigation regressions compared to that version).",
        "The currently-deployed version remains accessible via a separate, clearly identified access path (e.g., a preview URL or versioned path), without impacting the restored production version.",
        "No data/content stored in the backend is lost due to the rollback (CMS content, messages, settings remain intact)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/releaseChannel.ts",
          "operation": "create",
          "description": "Add a small utility to derive an app release channel (e.g., production vs preview) and an optional preview identifier from build-time variables and/or URL hints, to support distinct access paths while sharing the same backend data."
        },
        {
          "path": "frontend/src/utils/routerBasePath.ts",
          "operation": "create",
          "description": "Add a utility that derives a router base path from runtime location (and/or build-time configuration) to allow the app to be served under a versioned/preview path without breaking internal navigation."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire configurable base path support into the TanStack router creation so the same frontend can run correctly under a production root path and an alternate preview/versioned path. Ensure the preview channel can be clearly identified in the UI (paired with the version label work)."
        },
        {
          "path": "frontend/src/components/BuildVersionLabel.tsx",
          "operation": "modify",
          "description": "Extend the version label component (added in REQ-52) to optionally display a non-intrusive preview indicator when the release channel is not production. Use the shadcn-ui Badge component for consistent styling. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Display a visible build/version identifier on public pages and the admin login screen (English only).",
      "acceptanceCriteria": [
        "Public pages display a small, non-intrusive version label (e.g., in the footer) indicating the build/version string.",
        "Admin login screen displays the same build/version label.",
        "The version label is present in production builds and can be used to distinguish the restored version from the broken one."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/buildInfo.ts",
          "operation": "create",
          "description": "Implement a single source of truth for the app build/version string (read from build-time variables with safe fallbacks) to be consumed by UI surfaces."
        },
        {
          "path": "frontend/src/components/BuildVersionLabel.tsx",
          "operation": "create",
          "description": "Create a small, non-intrusive version label component that renders the build/version string in English. Use shadcn-ui Badge (or similarly minimal shadcn-ui primitives) to keep it unobtrusive. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Render the BuildVersionLabel in the public footer so it appears on all public pages without affecting layout (keep it small and non-intrusive)."
        },
        {
          "path": "frontend/src/admin/AdminLogin.tsx",
          "operation": "modify",
          "description": "Render the BuildVersionLabel on the admin login screen (e.g., beneath the form) using English-only text."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Add a startup-safe release flow: show a clear English error screen with deterministic recovery when backend is unreachable or a fatal runtime error occurs.",
      "acceptanceCriteria": [
        "If the backend cannot be reached at load time, the app renders a user-friendly English error state with a working recovery action (Reload and/or Try Again).",
        "If a runtime exception occurs during public route rendering, a user-friendly English error UI is shown instead of a blank/white screen.",
        "Recovery actions do not cause infinite loading loops; they deterministically retry initialization and either recover or re-display the error state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartupHealthGate.tsx",
          "operation": "create",
          "description": "Create a gate component that performs a backend reachability check at startup (using the existing backend health hook) and shows a full-screen English error UI with deterministic recovery actions (Try Again triggers a single refetch; Reload performs a hard reload). Use existing shadcn-ui components for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the router rendering with StartupHealthGate so the app never shows a blank/broken screen on initial backend unreachability, and retries are user-driven (no infinite loops)."
        },
        {
          "path": "frontend/src/components/PublicAppErrorBoundary.tsx",
          "operation": "modify",
          "description": "Ensure the public error boundary recovery actions are deterministic and remain English-only; align button labels and navigation behavior with the startup gate (Reload/Try Again style) to avoid white-screen failures during public route rendering."
        }
      ]
    }
  ]
}