{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Working CRUD Admin Editors for Sections, Products, Gallery, Contact Info, and Messages",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace placeholder admin editor pages with working CRUD UIs backed by existing canister methods and the current admin session token.",
      "acceptanceCriteria": [
        "Visiting /admin/sections no longer shows the placeholder text and provides a working UI to list, create, edit, and delete sections.",
        "Visiting /admin/products no longer shows the placeholder text and provides a working UI to list, create, edit, and delete products (name, description, price, imageUrl).",
        "Visiting /admin/gallery no longer shows the placeholder text and provides a working UI to list, create, edit, and delete gallery items (title, caption, imageUrl).",
        "Visiting /admin/contact no longer shows the placeholder text and provides a working UI to view and update contact info (address, phone, email).",
        "Visiting /admin/messages no longer shows the placeholder text and provides a working UI to list messages and delete a message.",
        "All admin editor actions require and use the current admin session token (from existing admin session handling)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/pages/SectionsEditor.tsx",
          "operation": "modify",
          "description": "Replace the placeholder with a working Sections CRUD editor: fetch list via existing query hook, add/edit forms, delete confirmation, and ensure create/update/delete calls use the admin token from useAdminSession. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/ProductsEditor.tsx",
          "operation": "modify",
          "description": "Replace the placeholder with a working Products CRUD editor (name/description/price/imageUrl): list view, add/edit forms with BigInt price handling, and delete confirmation; all mutations must use the admin token from useAdminSession. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/GalleryEditor.tsx",
          "operation": "modify",
          "description": "Replace the placeholder with a working Gallery CRUD editor (title/caption/imageUrl): list view, add/edit forms, and delete confirmation; all mutations must use the admin token from useAdminSession. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/ContactInfoEditor.tsx",
          "operation": "modify",
          "description": "Replace the placeholder with a working Contact Info editor: load existing contact info and provide an update-only form (address/phone/email) that uses the admin token from useAdminSession. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/MessagesInbox.tsx",
          "operation": "modify",
          "description": "Replace the placeholder with a working Messages inbox: list messages using the admin token and allow deleting a message with confirmation; delete must use the admin token from useAdminSession. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add React Query mutation hooks for admin content management and wire them into admin editor pages with query invalidation and session-token-aware errors.",
      "acceptanceCriteria": [
        "There are mutation hooks available for: createSection, updateSection, deleteSection; addProduct, updateProduct, deleteProduct; addGalleryItem, updateGalleryItem, deleteGalleryItem; updateContactInfo; deleteMessage.",
        "After a successful create/update/delete, the relevant query cache is invalidated and the UI updates without needing a full page reload.",
        "If the admin token is missing/expired, the UI shows a user-facing error state consistent with existing admin error handling (no silent failures)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/hooks/useAdminContentMutations.ts",
          "operation": "create",
          "description": "Create React Query mutation hooks for admin content management backed by existing actor methods: createSection/updateSection/deleteSection, addProduct/updateProduct/deleteProduct, addGalleryItem/updateGalleryItem/deleteGalleryItem, updateContactInfo, deleteMessage. Each mutation must require an adminToken input, normalize errors consistently (including unauthorized/expired token using existing admin error utilities), and invalidate the relevant queries (sections/products/gallery/contactInfo/messages)."
        },
        {
          "path": "frontend/src/admin/pages/SectionsEditor.tsx",
          "operation": "modify",
          "description": "Wire the new admin mutation hooks into the Sections editor page, including query invalidation-driven refresh after create/update/delete and a clear user-facing error when the admin token is missing/expired. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/ProductsEditor.tsx",
          "operation": "modify",
          "description": "Wire the new admin mutation hooks into the Products editor page, including query invalidation-driven refresh after add/update/delete and a clear user-facing error when the admin token is missing/expired. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/GalleryEditor.tsx",
          "operation": "modify",
          "description": "Wire the new admin mutation hooks into the Gallery editor page, including query invalidation-driven refresh after add/update/delete and a clear user-facing error when the admin token is missing/expired. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/ContactInfoEditor.tsx",
          "operation": "modify",
          "description": "Wire the new updateContactInfo mutation hook into the Contact Info editor page, including query invalidation-driven refresh after save and a clear user-facing error when the admin token is missing/expired. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/MessagesInbox.tsx",
          "operation": "modify",
          "description": "Wire the new deleteMessage mutation hook into the Messages inbox page, including query invalidation-driven refresh after delete and a clear user-facing error when the admin token is missing/expired. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement consistent admin editor UX across pages: list with loading/empty/error states, Add and Edit flows, delete confirmation, and basic form validation.",
      "acceptanceCriteria": [
        "Each editor page shows a loading state while fetching data and a clear empty state when there are no items.",
        "Each editor page provides an Add flow (except Contact Info which is update-only).",
        "Edit flows allow updating existing entries and saving changes.",
        "Delete flows require user confirmation before the delete mutation runs.",
        "Form validation prevents submitting empty required fields (e.g., section title/content; product name/description/imageUrl; gallery title/imageUrl; contact email/phone/address)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/admin/components/AdminDeleteConfirmDialog.tsx",
          "operation": "create",
          "description": "Add a reusable admin-only delete confirmation wrapper (composing existing shadcn/ui AlertDialog) to standardize confirmation UX across editors. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/components/AdminFormErrorAlert.tsx",
          "operation": "create",
          "description": "Add a small reusable form error alert/panel component (composing existing shadcn/ui Alert) to standardize validation + mutation error display across admin editor pages. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/SectionsEditor.tsx",
          "operation": "modify",
          "description": "Implement consistent UX: list view using LoadingState/ErrorState/EmptyState, Add section form with required-field validation, inline or modal edit flow, and delete confirmation using the shared confirmation component. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/ProductsEditor.tsx",
          "operation": "modify",
          "description": "Implement consistent UX: list view using LoadingState/ErrorState/EmptyState, Add product form with required-field + numeric price validation, edit flow, and delete confirmation using the shared confirmation component. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/GalleryEditor.tsx",
          "operation": "modify",
          "description": "Implement consistent UX: list view using LoadingState/ErrorState/EmptyState, Add gallery item form with required-field validation, edit flow, and delete confirmation using the shared confirmation component. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/ContactInfoEditor.tsx",
          "operation": "modify",
          "description": "Implement consistent UX: loading/error states when fetching, update-only form with required-field validation (email/phone/address), and consistent success/error feedback when saving. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/admin/pages/MessagesInbox.tsx",
          "operation": "modify",
          "description": "Implement consistent UX: loading/error/empty states for message list and delete confirmation flow for removing a message, with clear user-facing mutation errors. Compose (do not modify) shadcn/ui components; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}